Autodesk.Navisworks.Api.ModelItem
Represents an instance within the model hierarchy, corresponding to an item in the Navisworks selection tree

Autodesk.Navisworks.Api.ModelItem.Ancestors
All ancestors of this item (excluding item itself) within the model hierarchy

Autodesk.Navisworks.Api.ModelItem.AncestorsAndSelf
All ancestors of this item (including item itself) within the model hierarchy

Autodesk.Navisworks.Api.ModelItem.BoundingBox
Calculates bounding box of item and its children
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.BoundingBox(System.Boolean)
Calculates bounding box of item and its children
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.Children
Children of this item within the model hierarchy

Autodesk.Navisworks.Api.ModelItem.ClassDisplayName
Display name for type of item, derived from types in original design application.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.ClassName
Name for type of item. Derived from types in original design application.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.Descendants
All descendants of this item (excluding item itself) within the model hierarchy

Autodesk.Navisworks.Api.ModelItem.DescendantsAndSelf
All descendants of this item (including item itself) within the model hierarchy

Autodesk.Navisworks.Api.ModelItem.DisplayName
End user supplied name for item. May be null.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.ModelItem.FindFirstGeometry
Depth first search for geometry below this item in hierarchy
Returns: First geometry or null if none found
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.FindFirstObjectAncestor
Find ancestor that meets the requirements for First Object selection Behavior
Returns: Return ancestor that meets the requirements for First Object selection Behavior or nulll if no ancestor does
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.Geometry
Geometry for this item, null if it does not have geometry
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.ModelItem.GetUserFilteredPropertyCategories
Properties of this item filtered so that only the categories that the end user
would see in the GUI are shown (based on global options settings)

Autodesk.Navisworks.Api.ModelItem.HasGeometry
Does this item have geometry ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.HasModel
Does this item refer to a model ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.InstanceGuid
Guid for the instance data refered to by this item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.InstanceHashCode
HashCode for the instance data refered to by this item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.Instances
All items in the model hierarchy (including this item) that share instance data with this item

Autodesk.Navisworks.Api.ModelItem.IsCollection
Does this item represent a collection ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.IsComposite
Does this item represent a composite object ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.IsFrozen
Is this item frozen (frozen items cannot be picked graphically).

Autodesk.Navisworks.Api.ModelItem.IsHidden
Is this item hidden (won't be displayed in viewing window).

Autodesk.Navisworks.Api.ModelItem.IsInsert
Does this item represent an insert ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.IsLayer
Does this item represent a layer ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.ModelItem.IsRequired
Is this item required (will always display in viewing window, won't drop out).

Autodesk.Navisworks.Api.ModelItem.IsSameInstance(Autodesk.Navisworks.Api.ModelItem)
Does this item refer to the same instance data as another item ?
item: Other item to compare instance data with
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.ModelItem.Model
Model corresponding to item, null if it does not have a model
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.Parent
Parent item within the model hierarchy, null if this is the root of the hierarchy

Autodesk.Navisworks.Api.ModelItem.PropertyCategories
Properties of this item divided into multiple categories

Autodesk.Navisworks.Api.ModelItem.Self
This item as an enumerable collection of one item

Autodesk.Navisworks.Api.ModelItem.Transform
Returns the Transform attached to this item in the original source design file
Throws System.ObjectDisposedException:
Object has been Disposed